[
    {
        "Control ID": "A&A-01",
        "Control Domain": "Audit & Assurance",
        "Control Title": "Audit and Assurance Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain audit and assurance policies and procedures and standards. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "A&A-02",
        "Control Domain": "Audit & Assurance",
        "Control Title": "Independent Assessments",
        "Control Specification": "Conduct independent audit and assurance assessments according to relevant standards at least annually."
    },
    {
        "Control ID": "A&A-03",
        "Control Domain": "Audit & Assurance",
        "Control Title": "Risk Based Planning Assessment",
        "Control Specification": "Perform independent audit and assurance assessments according to risk-based plans and policies."
    },
    {
        "Control ID": "A&A-04",
        "Control Domain": "Audit & Assurance",
        "Control Title": "Requirements Compliance",
        "Control Specification": "Verify compliance with all relevant standards, regulations, legal/contractual, and statutory requirements applicable to the audit."
    },
    {
        "Control ID": "A&A-05",
        "Control Domain": "Audit & Assurance",
        "Control Title": "Audit Management Process",
        "Control Specification": "Define and implement an Audit Management process to support audit planning, risk analysis, security control assessment, conclusion, remediation schedules, report generation, and review of past reports and supporting evidence."
    },
    {
        "Control ID": "A&A-06",
        "Control Domain": "Audit & Assurance",
        "Control Title": "Remediation",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain a risk-based corrective action plan to remediate audit findings, review and report remediation status to relevant stakeholders."
    },
    {
        "Control ID": "AIS-01",
        "Control Domain": "Application & Interface Security",
        "Control Title": "Application and Interface Security Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for application security to provide guidance to the appropriate planning, delivery and support of the organization's application security capabilities. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "AIS-02",
        "Control Domain": "Application & Interface Security",
        "Control Title": "Application Security Baseline Requirements",
        "Control Specification": "Establish, document and maintain baseline requirements for securing different applications."
    },
    {
        "Control ID": "AIS-03",
        "Control Domain": "Application & Interface Security",
        "Control Title": "Application Security Metrics",
        "Control Specification": "Define and implement technical and operational metrics in alignment with business objectives, security requirements, and compliance obligations."
    },
    {
        "Control ID": "AIS-04",
        "Control Domain": "Application & Interface Security",
        "Control Title": "Secure Application Design and Development",
        "Control Specification": "Define and implement a SDLC process for application design, development, deployment, and operation in accordance with security requirements defined by the organization."
    },
    {
        "Control ID": "AIS-05",
        "Control Domain": "Application & Interface Security",
        "Control Title": "Automated Application Security Testing",
        "Control Specification": "Implement a testing strategy, including criteria for acceptance of new information systems, upgrades and new versions, which provides application security assurance and maintains compliance while enabling organizational speed of delivery goals. Automate when applicable and possible."
    },
    {
        "Control ID": "AIS-06",
        "Control Domain": "Application & Interface Security",
        "Control Title": "Automated Secure Application Deployment",
        "Control Specification": "Establish and implement strategies and capabilities for secure, standardized, and compliant application deployment. Automate where possible."
    },
    {
        "Control ID": "AIS-07",
        "Control Domain": "Application & Interface Security",
        "Control Title": "Application Vulnerability Remediation",
        "Control Specification": "Define and implement a process to remediate application security vulnerabilities, automating remediation when possible."
    },
    {
        "Control ID": "BCR-01",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Business Continuity Management Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain business continuity management and operational resilience policies and procedures. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "BCR-02",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Risk Assessment and Impact Analysis",
        "Control Specification": "Determine the impact of business disruptions and risks to establish criteria for developing business continuity and operational resilience strategies and capabilities."
    },
    {
        "Control ID": "BCR-03",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Business Continuity Strategy",
        "Control Specification": "Establish strategies to reduce the impact of, withstand, and recover from business disruptions within risk appetite."
    },
    {
        "Control ID": "BCR-04",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Business Continuity Planning",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain a business continuity plan based on the results of the operational resilience strategies and capabilities."
    },
    {
        "Control ID": "BCR-05",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Documentation",
        "Control Specification": "Develop, identify, and acquire documentation that is relevant to support the business continuity and operational resilience programs. Make the documentation available to authorized stakeholders and review periodically."
    },
    {
        "Control ID": "BCR-06",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Business Continuity Exercises",
        "Control Specification": "Exercise and test business continuity and operational resilience plans at least annually or upon significant changes."
    },
    {
        "Control ID": "BCR-07",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Communication",
        "Control Specification": "Establish communication with stakeholders and participants in the course of business continuity and resilience procedures."
    },
    {
        "Control ID": "BCR-08",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Backup",
        "Control Specification": "Periodically backup data stored in the cloud. Ensure the confidentiality, integrity and availability of the backup, and verify data restoration from backup for resiliency."
    },
    {
        "Control ID": "BCR-09",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Disaster Response Plan",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain a disaster response plan to recover from natural and man-made disasters. Update the plan at least annually or upon significant changes."
    },
    {
        "Control ID": "BCR-10",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Response Plan Exercise",
        "Control Specification": "Exercise the disaster response plan annually or upon significant changes, including if possible local emergency authorities."
    },
    {
        "Control ID": "BCR-11",
        "Control Domain": "Business Continuity Management and Operational Resilience",
        "Control Title": "Equipment Redundancy",
        "Control Specification": "Supplement business-critical equipment with redundant equipment independently located at a reasonable minimum distance in accordance with applicable industry standards."
    },
    {
        "Control ID": "CCC-01",
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Change Management Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for managing the risks associated with applying changes to organization assets, including application, systems, infrastructure, configuration, etc., regardless of whether the assets are managed internally or externally (i.e., outsourced). Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "CCC-02",
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Quality Testing",
        "Control Specification": "Follow a defined quality change control, approval and testing process with established baselines, testing, and release standards."
    },
    {
        "Control ID": "CCC-03",
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Change Management Technology",
        "Control Specification": "Manage the risks associated with applying changes to organization assets, including application, systems, infrastructure, configuration, etc., regardless of whether the assets are managed internally or externally (i.e., outsourced)."
    },
    {
        "Control ID": "CCC-04",
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Unauthorized Change Protection",
        "Control Specification": "Restrict the unauthorized addition, removal, update, and management of organization assets."
    },
    {
        "Control ID": "CCC-05",
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Change Agreements",
        "Control Specification": "Include provisions limiting changes directly impacting CSCs owned environments/tenants to explicitly authorized requests within service level agreements between CSPs and CSCs."
    },
    {
        "Control ID": "CCC-06",
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Change Management Baseline",
        "Control Specification": "Establish change management baselines for all relevant authorized changes on organization assets."
    },
    {
        "Control ID": "CCC-07",
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Detection of Baseline Deviation",
        "Control Specification": "Implement detection measures with proactive notification in case of changes deviating from the established baseline."
    },
    {
        "Control ID": "CCC-08",
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Exception Management",
        "Control Specification": "'Implement a procedure for the management of exceptions, including emergencies, in the change and configuration process. Align the procedure with the requirements of GRC-04: Policy Exception Process.'"
    },
    {
        "Control ID": "CCC-09",
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Change Restoration",
        "Control Specification": "Define and implement a process to proactively roll back changes to a previous known good state in case of errors or security concerns."
    },
    {
        "Control ID": "CEK-01",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption and Key Management Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for Cryptography, Encryption and Key Management. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "CEK-02",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "CEK Roles and Responsibilities",
        "Control Specification": "Define and implement cryptographic, encryption and key management roles and responsibilities."
    },
    {
        "Control ID": "CEK-03",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Data Encryption",
        "Control Specification": "Provide cryptographic protection to data at-rest and in-transit, using cryptographic libraries certified to approved standards."
    },
    {
        "Control ID": "CEK-04",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption Algorithm",
        "Control Specification": "Use encryption algorithms that are appropriate for data protection, considering the classification of data, associated risks, and usability of the encryption technology."
    },
    {
        "Control ID": "CEK-05",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption Change Management",
        "Control Specification": "Establish a standard change management procedure, to accommodate changes from internal and external sources, for review, approval, implementation and communication of cryptographic, encryption and key management technology changes."
    },
    {
        "Control ID": "CEK-06",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption Change Cost Benefit Analysis",
        "Control Specification": "Manage and adopt changes to cryptography-, encryption-, and key management-related systems (including policies and procedures) that fully account for downstream effects of proposed changes, including residual risk, cost, and benefits analysis."
    },
    {
        "Control ID": "CEK-07",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption Risk Management",
        "Control Specification": "Establish and maintain an encryption and key management risk program that includes provisions for risk assessment, risk treatment, risk context, monitoring, and feedback."
    },
    {
        "Control ID": "CEK-08",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "CSC Key Management Capability",
        "Control Specification": "CSPs must provide the capability for CSCs to manage their own data encryption keys."
    },
    {
        "Control ID": "CEK-09",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption and Key Management Audit",
        "Control Specification": "Audit encryption and key management systems, policies, and processes with a frequency that is proportional to the risk exposure of the system with audit occurring preferably continuously but at least annually and after any security event(s)."
    },
    {
        "Control ID": "CEK-10",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Generation",
        "Control Specification": "Generate Cryptographic keys using industry accepted cryptographic libraries specifying the algorithm strength and the random number generator used."
    },
    {
        "Control ID": "CEK-11",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Purpose",
        "Control Specification": "Manage cryptographic secret and private keys that are provisioned for a unique purpose."
    },
    {
        "Control ID": "CEK-12",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Rotation",
        "Control Specification": "Rotate cryptographic keys in accordance with the calculated cryptoperiod, which includes provisions for considering the risk of information disclosure and legal and regulatory requirements."
    },
    {
        "Control ID": "CEK-13",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Revocation",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to revoke and remove cryptographic keys prior to the end of its established cryptoperiod, when a key is compromised, or an entity is no longer part of the organization, which include provisions for legal and regulatory requirements."
    },
    {
        "Control ID": "CEK-14",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Destruction",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to destroy keys stored outside a secure environment and revoke keys stored in Hardware Security Modules (HSMs) when they are no longer needed, which include provisions for legal and regulatory requirements."
    },
    {
        "Control ID": "CEK-15",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Activation",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to create keys in a pre-activated state when they have been generated but not authorized for use, which include provisions for legal and regulatory requirements."
    },
    {
        "Control ID": "CEK-16",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Suspension",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to monitor, review and approve key transitions from any state to/from suspension, which include provisions for legal and regulatory requirements."
    },
    {
        "Control ID": "CEK-17",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Deactivation",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to deactivate keys at the time of their expiration date, which include provisions for legal and regulatory requirements."
    },
    {
        "Control ID": "CEK-18",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Archival",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to manage archived keys in a secure repository requiring least privilege access, which include provisions for legal and regulatory requirements."
    },
    {
        "Control ID": "CEK-19",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Compromise",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to use compromised keys to encrypt information only in controlled circumstance, and thereafter exclusively for decrypting data and never for encrypting data, which include provisions for legal and regulatory requirements."
    },
    {
        "Control ID": "CEK-20",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Recovery",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to assess the risk to operational continuity versus the risk of the keying material and the information it protects being exposed if control of the keying material is lost, which include provisions for legal and regulatory requirements."
    },
    {
        "Control ID": "CEK-21",
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Inventory Management",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures in order for the key management system to track and report all cryptographic materials and changes in status, which include provisions for legal and regulatory requirements."
    },
    {
        "Control ID": "DCS-01",
        "Control Domain": "Datacenter Security",
        "Control Title": "Off-Site Equipment Disposal Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for the secure disposal of equipment used outside the organization's premises. If the equipment is not physically destroyed a data destruction procedure that renders recovery of information impossible must be applied. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "DCS-02",
        "Control Domain": "Datacenter Security",
        "Control Title": "Off-Site Transfer Authorization Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for the relocation or transfer of hardware, software, or data/information to an offsite or alternate location. The relocation or transfer request requires the written or cryptographically verifiable authorization. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "DCS-03",
        "Control Domain": "Datacenter Security",
        "Control Title": "Secure Area Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for maintaining a safe and secure working environment in offices, rooms, and facilities. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "DCS-04",
        "Control Domain": "Datacenter Security",
        "Control Title": "Secure Media Transportation Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for the secure transportation of physical media. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "DCS-05",
        "Control Domain": "Datacenter Security",
        "Control Title": "Assets Classification",
        "Control Specification": "Classify and document the physical, and logical assets (e.g., applications) based on the organizational business risk."
    },
    {
        "Control ID": "DCS-06",
        "Control Domain": "Datacenter Security",
        "Control Title": "Assets Cataloguing and Tracking",
        "Control Specification": "Catalogue and track all relevant physical and logical assets located at all of the CSP's sites within a secured system."
    },
    {
        "Control ID": "DCS-07",
        "Control Domain": "Datacenter Security",
        "Control Title": "Controlled Access Points",
        "Control Specification": "Implement physical security perimeters to safeguard personnel, data, and information systems. Establish physical security perimeters between the administrative and business areas and the data storage and processing facilities areas."
    },
    {
        "Control ID": "DCS-08",
        "Control Domain": "Datacenter Security",
        "Control Title": "Equipment Identification",
        "Control Specification": "Use equipment identification as a method for connection authentication."
    },
    {
        "Control ID": "DCS-09",
        "Control Domain": "Datacenter Security",
        "Control Title": "Secure Area Authorization",
        "Control Specification": "Allow only authorized personnel access to secure areas, with all ingress and egress points restricted, documented, and monitored by physical access control mechanisms. Retain access control records on a periodic basis as deemed appropriate by the organization."
    },
    {
        "Control ID": "DCS-10",
        "Control Domain": "Datacenter Security",
        "Control Title": "Surveillance System",
        "Control Specification": "Implement, maintain, and operate datacenter surveillance systems at the external perimeter and at all the ingress and egress points to detect unauthorized ingress and egress attempts."
    },
    {
        "Control ID": "DCS-11",
        "Control Domain": "Datacenter Security",
        "Control Title": "Unauthorized Access Response Training",
        "Control Specification": "Train datacenter personnel to respond to unauthorized ingress or egress attempts."
    },
    {
        "Control ID": "DCS-12",
        "Control Domain": "Datacenter Security",
        "Control Title": "Cabling Security",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures that ensure a risk-based protection of power and telecommunication cables from a threat of interception, interference or damage at all facilities, offices and rooms."
    },
    {
        "Control ID": "DCS-13",
        "Control Domain": "Datacenter Security",
        "Control Title": "Environmental Systems",
        "Control Specification": "Implement and maintain data center environmental control systems that monitor, maintain and test for continual effectiveness the temperature and humidity conditions within accepted industry standards."
    },
    {
        "Control ID": "DCS-14",
        "Control Domain": "Datacenter Security",
        "Control Title": "Secure Utilities",
        "Control Specification": "Secure, monitor, maintain, and test utilities services for continual effectiveness at planned intervals."
    },
    {
        "Control ID": "DCS-15",
        "Control Domain": "Datacenter Security",
        "Control Title": "Equipment Location",
        "Control Specification": "Keep business-critical equipment away from locations subject to high probability for environmental risk events."
    },
    {
        "Control ID": "DSP-01",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Security and Privacy Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for the classification, protection and handling of data throughout its lifecycle, and according to all applicable laws and regulations, standards, and risk level. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "DSP-02",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Secure Disposal",
        "Control Specification": "Apply industry accepted methods for the secure disposal of data from storage media such that data is not recoverable by any forensic means."
    },
    {
        "Control ID": "DSP-03",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Inventory",
        "Control Specification": "Create and maintain a data inventory, at least for any sensitive data and personal data."
    },
    {
        "Control ID": "DSP-04",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Classification",
        "Control Specification": "Classify data according to its type and sensitivity level."
    },
    {
        "Control ID": "DSP-05",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Flow Documentation",
        "Control Specification": "Create data flow documentation to identify what data is processed, stored or transmitted where. Review data flow documentation at defined intervals, at least annually, and after any change."
    },
    {
        "Control ID": "DSP-06",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Ownership and Stewardship",
        "Control Specification": "Document ownership and stewardship of all relevant documented personal and sensitive data. Perform review at least annually."
    },
    {
        "Control ID": "DSP-07",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Protection by Design and Default",
        "Control Specification": "Develop systems, products, and business practices based upon a principle of security by design and industry best practices."
    },
    {
        "Control ID": "DSP-08",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Privacy by Design and Default",
        "Control Specification": "Develop systems, products, and business practices based upon a principle of privacy by design and industry best practices. Ensure that systems' privacy settings are configured by default, according to all applicable laws and regulations."
    },
    {
        "Control ID": "DSP-09",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Protection Impact Assessment",
        "Control Specification": "Conduct a Data Protection Impact Assessment (DPIA) to evaluate the origin, nature, particularity and severity of the risks upon the processing of personal data, according to any applicable laws, regulations and industry best practices."
    },
    {
        "Control ID": "DSP-10",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Sensitive Data Transfer",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures that ensure any transfer of personal or sensitive data is protected from unauthorized access and only processed within scope as permitted by the respective laws and regulations."
    },
    {
        "Control ID": "DSP-11",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Personal Data Access, Reversal, Rectification and Deletion",
        "Control Specification": "Define and implement, processes, procedures and technical measures to enable data subjects to request access to, modification, or deletion of their personal data, according to any applicable laws and regulations."
    },
    {
        "Control ID": "DSP-12",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Limitation of Purpose in Personal Data Processing",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to ensure that personal data is processed according to any applicable laws and regulations and for the purposes declared to the data subject."
    },
    {
        "Control ID": "DSP-13",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Personal Data Sub-processing",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures for the transfer and sub-processing of personal data within the service supply chain, according to any applicable laws and regulations."
    },
    {
        "Control ID": "DSP-14",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Disclosure of Data Sub-processors",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to disclose the details of any personal or sensitive data access by sub-processors to the data owner prior to initiation of that processing."
    },
    {
        "Control ID": "DSP-15",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Limitation of Production Data Use",
        "Control Specification": "Obtain authorization from data owners, and manage associated risk before replicating or using production data in non-production environments."
    },
    {
        "Control ID": "DSP-16",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Retention and Deletion",
        "Control Specification": "Data retention, archiving and deletion is managed in accordance with business requirements, applicable laws and regulations."
    },
    {
        "Control ID": "DSP-17",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Sensitive Data Protection",
        "Control Specification": "Define and implement, processes, procedures and technical measures to protect sensitive data throughout it's lifecycle."
    },
    {
        "Control ID": "DSP-18",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Disclosure Notification",
        "Control Specification": "The CSP must have in place, and describe to CSCs the procedure to manage and respond to requests for disclosure of Personal Data by Law Enforcement Authorities according to applicable laws and regulations. The CSP must give special attention to the notification procedure to interested CSCs, unless otherwise prohibited, such as a prohibition under criminal law to preserve confidentiality of a law enforcement investigation."
    },
    {
        "Control ID": "DSP-19",
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Location",
        "Control Specification": "Define and implement, processes, procedures and technical measures to specify and document the physical locations of data, including any locations in which data is processed or backed up."
    },
    {
        "Control ID": "GRC-01",
        "Control Domain": "Governance, Risk and Compliance",
        "Control Title": "Governance Program Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for an information governance program, which is sponsored by the leadership of the organization. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "GRC-02",
        "Control Domain": "Governance, Risk and Compliance",
        "Control Title": "Risk Management Program",
        "Control Specification": "Establish a formal, documented, and leadership-sponsored Enterprise Risk Management (ERM) program that includes policies and procedures for identification, evaluation, ownership, treatment, and acceptance of cloud security and privacy risks."
    },
    {
        "Control ID": "GRC-03",
        "Control Domain": "Governance, Risk and Compliance",
        "Control Title": "Organizational Policy Reviews",
        "Control Specification": "Review all relevant organizational policies and associated procedures at least annually or when a substantial change occurs within the organization."
    },
    {
        "Control ID": "GRC-04",
        "Control Domain": "Governance, Risk and Compliance",
        "Control Title": "Policy Exception Process",
        "Control Specification": "Establish and follow an approved exception process as mandated by the governance program whenever a deviation from an established policy occurs."
    },
    {
        "Control ID": "GRC-05",
        "Control Domain": "Governance, Risk and Compliance",
        "Control Title": "Information Security Program",
        "Control Specification": "Develop and implement an Information Security Program, which includes programs for all the relevant domains of the CCM."
    },
    {
        "Control ID": "GRC-06",
        "Control Domain": "Governance, Risk and Compliance",
        "Control Title": "Governance Responsibility Model",
        "Control Specification": "Define and document roles and responsibilities for planning, implementing, operating, assessing, and improving governance programs."
    },
    {
        "Control ID": "GRC-07",
        "Control Domain": "Governance, Risk and Compliance",
        "Control Title": "Information System Regulatory Mapping",
        "Control Specification": "Identify and document all relevant standards, regulations, legal/contractual, and statutory requirements, which are applicable to your organization."
    },
    {
        "Control ID": "GRC-08",
        "Control Domain": "Governance, Risk and Compliance",
        "Control Title": "Special Interest Groups",
        "Control Specification": "Establish and maintain contact with cloud-related special interest groups and other relevant entities in line with business context."
    },
    {
        "Control ID": "HRS-01",
        "Control Domain": "Human Resources",
        "Control Title": "Background Screening Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for background verification of all new employees (including but not limited to remote employees, contractors, and third parties) according to local laws, regulations, ethics, and contractual constraints and proportional to the data classification to be accessed, the business requirements, and acceptable risk. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "HRS-02",
        "Control Domain": "Human Resources",
        "Control Title": "Acceptable Use of Technology Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for defining allowances and conditions for the acceptable use of organizationally-owned or managed assets. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "HRS-03",
        "Control Domain": "Human Resources",
        "Control Title": "Clean Desk Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures that require unattended workspaces to not have openly visible confidential data. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "HRS-04",
        "Control Domain": "Human Resources",
        "Control Title": "Remote and Home Working Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures to protect information accessed, processed or stored at remote sites and locations. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "HRS-05",
        "Control Domain": "Human Resources",
        "Control Title": "Asset returns",
        "Control Specification": "Establish and document procedures for the return of organization-owned assets by terminated employees."
    },
    {
        "Control ID": "HRS-06",
        "Control Domain": "Human Resources",
        "Control Title": "Employment Termination",
        "Control Specification": "Establish, document, and communicate to all personnel the procedures outlining the roles and responsibilities concerning changes in employment."
    },
    {
        "Control ID": "HRS-07",
        "Control Domain": "Human Resources",
        "Control Title": "Employment Agreement Process",
        "Control Specification": "Employees sign the employee agreement prior to being granted access to organizational information systems, resources and assets."
    },
    {
        "Control ID": "HRS-08",
        "Control Domain": "Human Resources",
        "Control Title": "Employment Agreement Content",
        "Control Specification": "The organization includes within the employment agreements provisions and/or terms for adherence to established information governance and security policies."
    },
    {
        "Control ID": "HRS-09",
        "Control Domain": "Human Resources",
        "Control Title": "Personnel Roles and Responsibilities",
        "Control Specification": "Document and communicate roles and responsibilities of employees, as they relate to information assets and security."
    },
    {
        "Control ID": "HRS-10",
        "Control Domain": "Human Resources",
        "Control Title": "Non-Disclosure Agreements",
        "Control Specification": "Identify, document, and review, at planned intervals, requirements for non-disclosure/confidentiality agreements reflecting the organization's needs for the protection of data and operational details."
    },
    {
        "Control ID": "HRS-11",
        "Control Domain": "Human Resources",
        "Control Title": "Security Awareness Training",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain a security awareness training program for all employees of the organization and provide regular training updates."
    },
    {
        "Control ID": "HRS-12",
        "Control Domain": "Human Resources",
        "Control Title": "Personal and Sensitive Data Awareness and Training",
        "Control Specification": "Provide all employees with access to sensitive organizational and personal data with appropriate security awareness training and regular updates in organizational procedures, processes, and policies relating to their professional function relative to the organization."
    },
    {
        "Control ID": "HRS-13",
        "Control Domain": "Human Resources",
        "Control Title": "Compliance User Responsibility",
        "Control Specification": "Make employees aware of their roles and responsibilities for maintaining awareness and compliance with established policies and procedures and applicable legal, statutory, or regulatory compliance obligations."
    },
    {
        "Control ID": "IAM-01",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Identity and Access Management Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, implement, apply, evaluate and maintain policies and procedures for identity and access management. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "IAM-02",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Strong Password Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, implement, apply, evaluate and maintain strong password policies and procedures. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "IAM-03",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Identity Inventory",
        "Control Specification": "Manage, store, and review the information of system identities, and level of access."
    },
    {
        "Control ID": "IAM-04",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Separation of Duties",
        "Control Specification": "Employ the separation of duties principle when implementing information system access."
    },
    {
        "Control ID": "IAM-05",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Least Privilege",
        "Control Specification": "Employ the least privilege principle when implementing information system access."
    },
    {
        "Control ID": "IAM-06",
        "Control Domain": "Identity & Access Management",
        "Control Title": "User Access Provisioning",
        "Control Specification": "Define and implement a user access provisioning process which authorizes, records, and communicates access changes to data and assets."
    },
    {
        "Control ID": "IAM-07",
        "Control Domain": "Identity & Access Management",
        "Control Title": "User Access Changes and Revocation",
        "Control Specification": "De-provision or respectively modify access of movers / leavers or system identity changes in a timely manner in order to effectively adopt and communicate identity and access management policies."
    },
    {
        "Control ID": "IAM-08",
        "Control Domain": "Identity & Access Management",
        "Control Title": "User Access Review",
        "Control Specification": "Review and revalidate user access for least privilege and separation of duties with a frequency that is commensurate with organizational risk tolerance."
    },
    {
        "Control ID": "IAM-09",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Segregation of Privileged Access Roles",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures for the segregation of privileged access roles such that administrative access to data, encryption and key management capabilities and logging capabilities are distinct and separated."
    },
    {
        "Control ID": "IAM-10",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Management of Privileged Access Roles",
        "Control Specification": "Define and implement an access process to ensure privileged access roles and rights are granted for a time limited period, and implement procedures to prevent the culmination of segregated privileged access."
    },
    {
        "Control ID": "IAM-11",
        "Control Domain": "Identity & Access Management",
        "Control Title": "CSCs Approval for Agreed Privileged Access Roles",
        "Control Specification": "Define, implement and evaluate processes and procedures for customers to participate, where applicable, in the granting of access for agreed, high risk (as defined by the organizational risk assessment) privileged access roles."
    },
    {
        "Control ID": "IAM-12",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Safeguard Logs Integrity",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to ensure the logging infrastructure is read-only for all with write access, including privileged access roles, and that the ability to disable it is controlled through a procedure that ensures the segregation of duties and break glass procedures."
    },
    {
        "Control ID": "IAM-13",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Uniquely Identifiable Users",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures that ensure users are identifiable through unique IDs or which can associate individuals to the usage of user IDs."
    },
    {
        "Control ID": "IAM-14",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Strong Authentication",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures for authenticating access to systems, application and data assets, including multifactor authentication for at least privileged user and sensitive data access. Adopt digital certificates or alternatives which achieve an equivalent level of security for system identities."
    },
    {
        "Control ID": "IAM-15",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Passwords Management",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures for the secure management of passwords."
    },
    {
        "Control ID": "IAM-16",
        "Control Domain": "Identity & Access Management",
        "Control Title": "Authorization Mechanisms",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to verify access to data and system functions is authorized."
    },
    {
        "Control ID": "IPY-01",
        "Control Domain": "Interoperability & Portability",
        "Control Title": "Interoperability and Portability Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for interoperability and portability including requirements for: a. Communications between application interfaces b. Information processing interoperability c. Application development portability d. Information/Data exchange, usage, portability, integrity, and persistence Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "IPY-02",
        "Control Domain": "Interoperability & Portability",
        "Control Title": "Application Interface Availability",
        "Control Specification": "Provide application interface(s) to CSCs so that they programmatically retrieve their data to enable interoperability and portability."
    },
    {
        "Control ID": "IPY-03",
        "Control Domain": "Interoperability & Portability",
        "Control Title": "Secure Interoperability and Portability Management",
        "Control Specification": "Implement cryptographically secure and standardized network protocols for the management, import and export of data."
    },
    {
        "Control ID": "IPY-04",
        "Control Domain": "Interoperability & Portability",
        "Control Title": "Data Portability Contractual Obligations",
        "Control Specification": "Agreements must include provisions specifying CSCs access to data upon contract termination and will include: a. Data format b. Length of time the data will be stored c. Scope of the data retained and made available to the CSCs d. Data deletion policy"
    },
    {
        "Control ID": "IVS-01",
        "Control Domain": "Infrastructure & Virtualization Security",
        "Control Title": "Infrastructure and Virtualization Security Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for infrastructure and virtualization security. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "IVS-02",
        "Control Domain": "Infrastructure & Virtualization Security",
        "Control Title": "Capacity and Resource Planning",
        "Control Specification": "Plan and monitor the availability, quality, and adequate capacity of resources in order to deliver the required system performance as determined by the business."
    },
    {
        "Control ID": "IVS-03",
        "Control Domain": "Infrastructure & Virtualization Security",
        "Control Title": "Network Security",
        "Control Specification": "Monitor, encrypt and restrict communications between environments to only authenticated and authorized connections, as justified by the business. Review these configurations at least annually, and support them by a documented justification of all allowed services, protocols, ports, and compensating controls."
    },
    {
        "Control ID": "IVS-04",
        "Control Domain": "Infrastructure & Virtualization Security",
        "Control Title": "OS Hardening and Base Controls",
        "Control Specification": "Harden host and guest OS, hypervisor or infrastructure control plane according to their respective best practices, and supported by technical controls, as part of a security baseline."
    },
    {
        "Control ID": "IVS-05",
        "Control Domain": "Infrastructure & Virtualization Security",
        "Control Title": "Production and Non-Production Environments",
        "Control Specification": "Separate production and non-production environments."
    },
    {
        "Control ID": "IVS-06",
        "Control Domain": "Infrastructure & Virtualization Security",
        "Control Title": "Segmentation and Segregation",
        "Control Specification": "Design, develop, deploy and configure applications and infrastructures such that CSP and CSC (tenant) user access and intra-tenant access is appropriately segmented and segregated, monitored and restricted from other tenants."
    },
    {
        "Control ID": "IVS-07",
        "Control Domain": "Infrastructure & Virtualization Security",
        "Control Title": "Migration to Cloud Environments",
        "Control Specification": "Use secure and encrypted communication channels when migrating servers, services, applications, or data to cloud environments. Such channels must include only up-to-date and approved protocols."
    },
    {
        "Control ID": "IVS-08",
        "Control Domain": "Infrastructure & Virtualization Security",
        "Control Title": "Network Architecture Documentation",
        "Control Specification": "Identify and document high-risk environments."
    },
    {
        "Control ID": "IVS-09",
        "Control Domain": "Infrastructure & Virtualization Security",
        "Control Title": "Network Defense",
        "Control Specification": "Define, implement and evaluate processes, procedures and defense-in-depth techniques for protection, detection, and timely response to network-based attacks."
    },
    {
        "Control ID": "LOG-01",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Logging and Monitoring Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for logging and monitoring. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "LOG-02",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Audit Logs Protection",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to ensure the security and retention of audit logs."
    },
    {
        "Control ID": "LOG-03",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Security Monitoring and Alerting",
        "Control Specification": "Identify and monitor security-related events within applications and the underlying infrastructure. Define and implement a system to generate alerts to responsible stakeholders based on such events and corresponding metrics."
    },
    {
        "Control ID": "LOG-04",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Audit Logs Access and Accountability",
        "Control Specification": "Restrict audit logs access to authorized personnel and maintain records that provide unique access accountability."
    },
    {
        "Control ID": "LOG-05",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Audit Logs Monitoring and Response",
        "Control Specification": "Monitor security audit logs to detect activity outside of typical or expected patterns. Establish and follow a defined process to review and take appropriate and timely actions on detected anomalies."
    },
    {
        "Control ID": "LOG-06",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Clock Synchronization",
        "Control Specification": "Use a reliable time source across all relevant information processing systems."
    },
    {
        "Control ID": "LOG-07",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Logging Scope",
        "Control Specification": "Establish, document and implement which information meta/data system events should be logged. Review and update the scope at least annually or whenever there is a change in the threat environment."
    },
    {
        "Control ID": "LOG-08",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Log Records",
        "Control Specification": "Generate audit records containing relevant security information."
    },
    {
        "Control ID": "LOG-09",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Log Protection",
        "Control Specification": "The information system protects audit records from unauthorized access, modification, and deletion."
    },
    {
        "Control ID": "LOG-10",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Encryption Monitoring and Reporting",
        "Control Specification": "Establish and maintain a monitoring and internal reporting capability over the operations of cryptographic, encryption and key management policies, processes, procedures, and controls."
    },
    {
        "Control ID": "LOG-11",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Transaction/Activity Logging",
        "Control Specification": "Log and monitor key lifecycle management events to enable auditing and reporting on usage of cryptographic keys."
    },
    {
        "Control ID": "LOG-12",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Access Control Logs",
        "Control Specification": "Monitor and log physical access using an auditable access control system."
    },
    {
        "Control ID": "LOG-13",
        "Control Domain": "Logging and Monitoring",
        "Control Title": "Failures and Anomalies Reporting",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures for the reporting of anomalies and failures of the monitoring system and provide immediate notification to the accountable party."
    },
    {
        "Control ID": "SEF-01",
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Security Incident Management Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for Security Incident Management, E-Discovery, and Cloud Forensics. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "SEF-02",
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Service Management Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for the timely management of security incidents. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "SEF-03",
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Incident Response Plans",
        "Control Specification": "'Establish, document, approve, communicate, apply, evaluate and maintain a security incident response plan, which includes but is not limited to: relevant internal departments, impacted CSCs, and other business critical relationships (such as supply-chain) that may be impacted.'"
    },
    {
        "Control ID": "SEF-04",
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Incident Response Testing",
        "Control Specification": "Test and update as necessary incident response plans at planned intervals or upon significant organizational or environmental changes for effectiveness."
    },
    {
        "Control ID": "SEF-05",
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Incident Response Metrics",
        "Control Specification": "Establish and monitor information security incident metrics."
    },
    {
        "Control ID": "SEF-06",
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Event Triage Processes",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures supporting business processes to triage security-related events."
    },
    {
        "Control ID": "SEF-07",
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Security Breach Notification",
        "Control Specification": "Define and implement, processes, procedures and technical measures for security breach notifications. Report security breaches and assumed security breaches including any relevant supply chain breaches, as per applicable SLAs, laws and regulations."
    },
    {
        "Control ID": "SEF-08",
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Points of Contact Maintenance",
        "Control Specification": "Maintain points of contact for applicable regulation authorities, national and local law enforcement, and other legal jurisdictional authorities."
    },
    {
        "Control ID": "STA-01",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "SSRM Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for the application of the Shared Security Responsibility Model (SSRM) within the organization. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "STA-02",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "SSRM Supply Chain",
        "Control Specification": "Apply, document, implement and manage the SSRM throughout the supply chain for the cloud service offering."
    },
    {
        "Control ID": "STA-03",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "SSRM Guidance",
        "Control Specification": "Provide SSRM Guidance to the CSC detailing information about the SSRM applicability throughout the supply chain."
    },
    {
        "Control ID": "STA-04",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "SSRM Control Ownership",
        "Control Specification": "Delineate the shared ownership and applicability of all CSA CCM controls according to the SSRM for the cloud service offering."
    },
    {
        "Control ID": "STA-05",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "SSRM Documentation Review",
        "Control Specification": "Review and validate SSRM documentation for all cloud services offerings the organization uses."
    },
    {
        "Control ID": "STA-06",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "SSRM Control Implementation",
        "Control Specification": "Implement, operate, and audit or assess the portions of the SSRM which the organization is responsible for."
    },
    {
        "Control ID": "STA-07",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "Supply Chain Inventory",
        "Control Specification": "Develop and maintain an inventory of all supply chain relationships."
    },
    {
        "Control ID": "STA-08",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "Supply Chain Risk Management",
        "Control Specification": "CSPs periodically review risk factors associated with all organizations within their supply chain."
    },
    {
        "Control ID": "STA-09",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "Primary Service and Contractual Agreement",
        "Control Specification": "Service agreements between CSPs and CSCs (tenants) must incorporate at least the following mutually-agreed upon provisions and/or terms: • Scope, characteristics and location of business relationship and services offered • Information security requirements (including SSRM) • Change management process • Logging and monitoring capability • Incident management and communication procedures • Right to audit and third party assessment • Service termination • Interoperability and portability requirements • Data privacy"
    },
    {
        "Control ID": "STA-10",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "Supply Chain Agreement Review",
        "Control Specification": "Review supply chain agreements between CSPs and CSCs at least annually."
    },
    {
        "Control ID": "STA-11",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "Internal Compliance Testing",
        "Control Specification": "Define and implement a process for conducting internal assessments to confirm conformance and effectiveness of standards, policies, procedures, and service level agreement activities at least annually."
    },
    {
        "Control ID": "STA-12",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "Supply Chain Service Agreement Compliance",
        "Control Specification": "Implement policies requiring all CSPs throughout the supply chain to comply with information security, confidentiality, access control, privacy, audit, personnel policy and service level requirements and standards."
    },
    {
        "Control ID": "STA-13",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "Supply Chain Governance Review",
        "Control Specification": "Periodically review the organization's supply chain partners' IT governance policies and procedures."
    },
    {
        "Control ID": "STA-14",
        "Control Domain": "Supply Chain Management, Transparency, and Accountability",
        "Control Title": "Supply Chain Data Security Assessment",
        "Control Specification": "Define and implement a process for conducting security assessments periodically for all organizations within the supply chain."
    },
    {
        "Control ID": "TVM-01",
        "Control Domain": "Threat & Vulnerability Management",
        "Control Title": "Threat and Vulnerability Management Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures to identify, report and prioritize the remediation of vulnerabilities, in order to protect systems against vulnerability exploitation. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "TVM-02",
        "Control Domain": "Threat & Vulnerability Management",
        "Control Title": "Malware Protection Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures to protect against malware on managed assets. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "TVM-03",
        "Control Domain": "Threat & Vulnerability Management",
        "Control Title": "Vulnerability Remediation Schedule",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to enable both scheduled and emergency responses to vulnerability identifications, based on the identified risk."
    },
    {
        "Control ID": "TVM-04",
        "Control Domain": "Threat & Vulnerability Management",
        "Control Title": "Detection Updates",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to update detection tools, threat signatures, and indicators of compromise on a weekly, or more frequent basis."
    },
    {
        "Control ID": "TVM-05",
        "Control Domain": "Threat & Vulnerability Management",
        "Control Title": "External Library Vulnerabilities",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to identify updates for applications which use third party or open source libraries according to the organization's vulnerability management policy."
    },
    {
        "Control ID": "TVM-06",
        "Control Domain": "Threat & Vulnerability Management",
        "Control Title": "Penetration Testing",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures for the periodic performance of penetration testing by independent third parties."
    },
    {
        "Control ID": "TVM-07",
        "Control Domain": "Threat & Vulnerability Management",
        "Control Title": "Vulnerability Identification",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures for the detection of vulnerabilities on organizationally managed assets at least monthly."
    },
    {
        "Control ID": "TVM-08",
        "Control Domain": "Threat & Vulnerability Management",
        "Control Title": "Vulnerability Prioritization",
        "Control Specification": "Use a risk-based model for effective prioritization of vulnerability remediation using an industry recognized framework."
    },
    {
        "Control ID": "TVM-09",
        "Control Domain": "Threat & Vulnerability Management",
        "Control Title": "Vulnerability Management Reporting",
        "Control Specification": "Define and implement a process for tracking and reporting vulnerability identification and remediation activities that includes stakeholder notification."
    },
    {
        "Control ID": "TVM-10",
        "Control Domain": "Threat & Vulnerability Management",
        "Control Title": "Vulnerability Management Metrics",
        "Control Specification": "Establish, monitor and report metrics for vulnerability identification and remediation at defined intervals."
    },
    {
        "Control ID": "UEM-01",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Endpoint Devices Policy and Procedures",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain policies and procedures for all endpoints. Review and update the policies and procedures at least annually."
    },
    {
        "Control ID": "UEM-02",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Application and Service Approval",
        "Control Specification": "Define, document, apply and evaluate a list of approved services, applications and sources of applications (stores) acceptable for use by endpoints when accessing or storing organization-managed data."
    },
    {
        "Control ID": "UEM-03",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Compatibility",
        "Control Specification": "Define and implement a process for the validation of the endpoint device's compatibility with operating systems and applications."
    },
    {
        "Control ID": "UEM-04",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Endpoint Inventory",
        "Control Specification": "Maintain an inventory of all endpoints used to store and access company data."
    },
    {
        "Control ID": "UEM-05",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Endpoint Management",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to enforce policies and controls for all endpoints permitted to access systems and/or store, transmit, or process organizational data."
    },
    {
        "Control ID": "UEM-06",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Automatic Lock Screen",
        "Control Specification": "Configure all relevant interactive-use endpoints to require an automatic lock screen."
    },
    {
        "Control ID": "UEM-07",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Operating Systems",
        "Control Specification": "Manage changes to endpoint operating systems, patch levels, and/or applications through the company's change management processes."
    },
    {
        "Control ID": "UEM-08",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Storage Encryption",
        "Control Specification": "Protect information from unauthorized disclosure on managed endpoint devices with storage encryption."
    },
    {
        "Control ID": "UEM-09",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Anti-Malware Detection and Prevention",
        "Control Specification": "Configure managed endpoints with anti-malware detection and prevention technology and services."
    },
    {
        "Control ID": "UEM-10",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Software Firewall",
        "Control Specification": "Configure managed endpoints with properly configured software firewalls."
    },
    {
        "Control ID": "UEM-11",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Data Loss Prevention",
        "Control Specification": "Configure managed endpoints with Data Loss Prevention (DLP) technologies and rules in accordance with a risk assessment."
    },
    {
        "Control ID": "UEM-12",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Remote Locate",
        "Control Specification": "Enable remote geo-location capabilities for all managed mobile endpoints."
    },
    {
        "Control ID": "UEM-13",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Remote Wipe",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical measures to enable the deletion of company data remotely on managed endpoint devices."
    },
    {
        "Control ID": "UEM-14",
        "Control Domain": "Universal Endpoint Management",
        "Control Title": "Third-Party Endpoint Security Posture",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical and/or contractual measures to maintain proper security of third-party endpoints with access to organizational assets."
    }
]