{
  "technique": "System Information Discovery",
  "techniqueId": "T1082",
  "platforms": [
    "IaaS",
    "Linux",
    "Network",
    "Windows",
    "macOS"
  ],
  "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\n\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). System Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment.\n\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.",
  "procedure_examples": [
    {
      "name": "4H RAT",
      "url": "/software/S0065",
      "description": "4H RAT sends an OS version identifier in its beacons.",
      "references": [
        {
          "url": "http://cdn0.vox-cdn.com/assets/4589853/crowdstrike-intelligence-report-putter-panda.original.pdf",
          "source_name": "CrowdStrike Putter Panda"
        }
      ]
    },
    {
      "name": "Action RAT",
      "url": "/software/S1028",
      "description": "Action RAT has the ability to collect the hostname, OS version, and OS architecture of an infected host.",
      "references": [
        {
          "url": "https://www.malwarebytes.com/blog/news/2021/12/sidecopy-apt-connecting-lures-to-victims-payloads-to-infrastructure",
          "source_name": "MalwareBytes SideCopy Dec 2021"
        }
      ]
    },
    {
      "name": "admin@338",
      "url": "/groups/G0018",
      "description": "admin@338 actors used the following commands after exploiting a machine with LOWBALL malware to obtain information about the OS: ver >> %temp%\\download systeminfo >> %temp%\\download",
      "references": [
        {
          "url": "https://www.fireeye.com/blog/threat-research/2015/11/china-based-threat.html",
          "source_name": "FireEye admin@338"
        }
      ]
    },
    {
      "name": "ADVSTORESHELL",
      "url": "/software/S0045",
      "description": "ADVSTORESHELL can run Systeminfo to gather information about the victim.",
      "references": [
        {
          "url": "http://www.welivesecurity.com/wp-content/uploads/2016/10/eset-sednit-part-2.pdf",
          "source_name": "ESET Sednit Part 2"
        }
      ]
    },
    {
      "name": "Agent Tesla",
      "url": "/software/S0331",
      "description": "Agent Tesla can collect the system's computer name and also has the capability to collect information on the processor, memory, OS, and video card from the system.",
      "references": [
        {
          "url": "https://www.fortinet.com/blog/threat-research/analysis-of-new-agent-tesla-spyware-variant.html",
          "source_name": "Fortinet Agent Tesla April 2018"
        }
      ]
    },
    {
      "name": "Akira",
      "url": "/software/S1129",
      "description": "Akira uses the GetSystemInfo Windows function to determine the number of processors on a victim machine.",
      "references": [
        {
          "url": "https://www.trellix.com/blogs/research/akira-ransomware/",
          "source_name": "Kersten Akira 2023"
        }
      ]
    },
    {
      "name": "Amadey",
      "url": "/software/S1025",
      "description": "Amadey has collected the computer name and OS version from a compromised machine.",
      "references": [
        {
          "url": "https://www.fsec.or.kr/user/bbs/fsec/163/344/bbsDataView/1382.do?page=1&column=&search=&searchSDate=&searchEDate=&bbsDataCategory=",
          "source_name": "Korean FSI TA505 2020"
        }
      ]
    },
    {
      "name": "Anchor",
      "url": "/software/S0504",
      "description": "Anchor can determine the hostname and linux version on a compromised host.",
      "references": [
        {
          "url": "https://medium.com/stage-2-security/anchor-dns-malware-family-goes-cross-platform-d807ba13ca30",
          "source_name": "Medium Anchor DNS July 2020"
        }
      ]
    },
    {
      "name": "AppleJeus",
      "url": "/software/S0584",
      "description": "AppleJeus has collected the victim host information after infection.",
      "references": [
        {
          "url": "https://us-cert.cisa.gov/ncas/alerts/aa21-048a",
          "source_name": "CISA AppleJeus Feb 2021"
        }
      ]
    },
    {
      "name": "AppleSeed",
      "url": "/software/S0622",
      "description": "AppleSeed can identify the OS version of a targeted system.",
      "references": [
        {
          "url": "https://blog.malwarebytes.com/threat-analysis/2021/06/kimsuky-apt-continues-to-target-south-korean-government-using-appleseed-backdoor/",
          "source_name": "Malwarebytes Kimsuky June 2021"
        }
      ]
    }
  ],
  "mitigations": [
    "This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features."
  ],
  "detection": [
    "Monitor executed commands and arguments that may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. For network devices, monitor executed commands in AAA logs, especially those run by unexpected or unauthorized users.",
    "Monitor for API calls that may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Remote access tools with built-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as Windows Management Instrumentation and PowerShell. In cloud-based systems, native logging can be used to identify access to certain APIs and dashboards that may contain system information. Depending on how the environment is used, that data alone may not be useful due to benign use during normal operations.",
    "Monitor newly executed processes that may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture."
  ]
}
